tests/framework/CodeInterfaceTests/OpenFOAM/all_variables_and_centroids/twoSimpleRotors/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

#alias runApplication='openfoam'

./Allrun.pre

runApplication $(getApplication)

#------------------------------------------------------------------------------

